src/test/resources/soap-request.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:esb="http://esb.abc.org" xmlns:typ="http://esb.abc.org/claims/">
   <soapenv:Header>
      <esb:sinfo guid="?" userRef="?" senderMachine="?" ping="?" conversationID="?" correlationID="?" appname="?"/>
   </soapenv:Header>
   <soapenv:Body>
      <typ:submitClaim>
         <typ:orchestrationID>?</typ:orchestrationID>
         <typ:interactionID>?</typ:interactionID>
         <typ:userConfirmNumber>?</typ:userConfirmNumber>
         <typ:RequestType>?</typ:RequestType>
         <typ:SubmitDateTime>?</typ:SubmitDateTime>
         <typ:FormDetails>
            <!--Zero or more repetitions:-->
            <typ:FormDetail>
               <typ:FormName>?</typ:FormName>
               <!--You have a CHOICE of the next 2 items at this level-->
               <typ:FormURL>?</typ:FormURL>
               <typ:FormContents>cid:1243410348439</typ:FormContents>
            </typ:FormDetail>
         </typ:FormDetails>
         <typ:ProposalPayload>
            <typ:AccountInformation>
               <typ:TypeOfAccount>?</typ:TypeOfAccount>
               <!--Optional:-->
               <typ:OtherAccountName>?</typ:OtherAccountName>
               <!--Optional:-->
               <typ:AccountNickName>?</typ:AccountNickName>
               <typ:ProposalNumber>?</typ:ProposalNumber>
            </typ:AccountInformation>
            <!--1 or more repetitions:-->
            <typ:PersonalInformation>
               <typ:FirstName>?</typ:FirstName>
               <!--Optional:-->
               <typ:MiddleInitial>?</typ:MiddleInitial>
               <typ:LastName>?</typ:LastName>
               <!--Optional:-->
               <typ:Prefix>?</typ:Prefix>
               <!--Optional:-->
               <typ:Suffix>?</typ:Suffix>
               <typ:SSN>?</typ:SSN>
               <typ:DateOfBirth>?</typ:DateOfBirth>
               <typ:ClientAddresses>
                  <!--Zero or more repetitions:-->
                  <typ:UserAddress>
                     <typ:TypeOfAddress>?</typ:TypeOfAddress>
                     <typ:AddressInfo>
                        <typ:AddressLine1>?</typ:AddressLine1>
                        <!--Optional:-->
                        <typ:AddressLine2>?</typ:AddressLine2>
                        <typ:City>?</typ:City>
                        <typ:State>?</typ:State>
                        <typ:Zip>?</typ:Zip>
                        <!--Optional:-->
                        <typ:Zip4>?</typ:Zip4>
                        <typ:CountryCode>?</typ:CountryCode>
                     </typ:AddressInfo>
                  </typ:UserAddress>
               </typ:ClientAddresses>
               <typ:ContactInformations>
                  <!--Zero or more repetitions:-->
                  <typ:ContactInformation>
                     <typ:TypeOfPhone>?</typ:TypeOfPhone>
                     <typ:PhoneNumber>
                        <typ:Number>?</typ:Number>
                        <!--Optional:-->
                        <typ:Extension>?</typ:Extension>
                     </typ:PhoneNumber>
                     <!--Optional:-->
                     <typ:PhoneCountryCode>?</typ:PhoneCountryCode>
                  </typ:ContactInformation>
               </typ:ContactInformations>
               <!--Optional:-->
               <typ:EmailAddress>?</typ:EmailAddress>
               <!--Optional:-->
               <typ:Citizenship>?</typ:Citizenship>
               <!--Optional:-->
               <typ:EmploymentInformation>
                  <typ:EmploymentStatus>?</typ:EmploymentStatus>
                  <!--Optional:-->
                  <typ:Title>?</typ:Title>
                  <!--Optional:-->
                  <typ:EmployerName>?</typ:EmployerName>
                  <!--Optional:-->
                  <typ:EmployerNameAddress>
                     <typ:AddressLine1>?</typ:AddressLine1>
                     <!--Optional:-->
                     <typ:AddressLine2>?</typ:AddressLine2>
                     <typ:City>?</typ:City>
                     <typ:State>?</typ:State>
                     <typ:Zip>?</typ:Zip>
                     <!--Optional:-->
                     <typ:Zip4>?</typ:Zip4>
                     <typ:CountryCode>?</typ:CountryCode>
                  </typ:EmployerNameAddress>
               </typ:EmploymentInformation>
               <typ:TypeOfAccountHolder>?</typ:TypeOfAccountHolder>
               <typ:InvestmentProfile>
                  <typ:Personalizations>
                     <!--Zero or more repetitions:-->
                     <typ:Personalization>
                        <!--Optional:-->
                        <typ:InitialInvestment>?</typ:InitialInvestment>
                        <!--Optional:-->
                        <typ:Rule>?</typ:Rule>
                        <!--Optional:-->
                        <typ:ApplyTo>?</typ:ApplyTo>
                        <!--Optional:-->
                        <typ:EffectiveFrom>?</typ:EffectiveFrom>
                        <!--Optional:-->
                        <typ:EffectiveTo>?</typ:EffectiveTo>
                        <!--Optional:-->
                        <typ:Asset>?</typ:Asset>
                        <!--Optional:-->
                        <typ:MinRange>?</typ:MinRange>
                        <!--Optional:-->
                        <typ:MaxRange>?</typ:MaxRange>
                        <!--Optional:-->
                        <typ:AssetGroup>?</typ:AssetGroup>
                        <!--Optional:-->
                        <typ:RecommendedAsset>?</typ:RecommendedAsset>
                        <!--Optional:-->
                        <typ:AssetPercentOfTotal>?</typ:AssetPercentOfTotal>
                        <!--Optional:-->
                        <typ:FederalTaxRate>?</typ:FederalTaxRate>
                     </typ:Personalization>
                  </typ:Personalizations>
                  <typ:InvestmentObjective>?</typ:InvestmentObjective>
               </typ:InvestmentProfile>
               <!--Optional:-->
               <typ:PIN>?</typ:PIN>
               <!--Optional:-->
               <typ:NPIN>?</typ:NPIN>
            </typ:PersonalInformation>
            <typ:AdvisorInformation>
               <typ:FirstName>?</typ:FirstName>
               <!--Optional:-->
               <typ:MiddleInitial>?</typ:MiddleInitial>
               <typ:LastName>?</typ:LastName>
               <!--Optional:-->
               <typ:Prefix>?</typ:Prefix>
               <!--Optional:-->
               <typ:Suffix>?</typ:Suffix>
               <typ:AdvisorAddresses>
                  <!--Zero or more repetitions:-->
                  <typ:UserAddress>
                     <typ:TypeOfAddress>?</typ:TypeOfAddress>
                     <typ:AddressInfo>
                        <typ:AddressLine1>?</typ:AddressLine1>
                        <!--Optional:-->
                        <typ:AddressLine2>?</typ:AddressLine2>
                        <typ:City>?</typ:City>
                        <typ:State>?</typ:State>
                        <typ:Zip>?</typ:Zip>
                        <!--Optional:-->
                        <typ:Zip4>?</typ:Zip4>
                        <typ:CountryCode>?</typ:CountryCode>
                     </typ:AddressInfo>
                  </typ:UserAddress>
               </typ:AdvisorAddresses>
               <typ:ContactInformations>
                  <!--Zero or more repetitions:-->
                  <typ:ContactInformation>
                     <typ:TypeOfPhone>?</typ:TypeOfPhone>
                     <typ:PhoneNumber>
                        <typ:Number>?</typ:Number>
                        <!--Optional:-->
                        <typ:Extension>?</typ:Extension>
                     </typ:PhoneNumber>
                     <!--Optional:-->
                     <typ:PhoneCountryCode>?</typ:PhoneCountryCode>
                  </typ:ContactInformation>
               </typ:ContactInformations>
               <typ:EmailAddress>?</typ:EmailAddress>
               <typ:RepCode>?</typ:RepCode>
               <typ:RACFID>?</typ:RACFID>
               <typ:HierarchialStructure>?</typ:HierarchialStructure>
            </typ:AdvisorInformation>
            <!--Optional:-->
            <typ:IncludeProspectus>?</typ:IncludeProspectus>
         </typ:ProposalPayload>
      </typ:submitClaim>
   </soapenv:Body>
</soapenv:Envelope>